trunk/app/controllers/administrators_controller.rb

SELECT "administrators".* FROM "administrators" LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "administrators"
---
  def index
    @administrators = Administrator.paginate(page: params[:page])

SELECT "administrators".* FROM "administrators" WHERE "administrators"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
  	@administrator = Administrator.find(params[:id])

INSERT INTO "administrators" ("created_at", "email", "kth_id", "name", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Thu, 19 Jul 2012 13:33:17 UTC +00:00], ["email", "dforsl@kth.se"], ["kth_id", "dforsl"], ["name", "Daniel Forslund"], ["updated_at", Thu, 19 Jul 2012 13:33:17 UTC +00:00]]
---
  def create
  	@administrator = Administrator.new(params[:administrator])
  	if @administrator.save

SELECT "administrators".* FROM "administrators" WHERE "administrators"."id" = ? LIMIT 1  [["id", "1"]]
---
  def edit
    @administrator = Administrator.find(params[:id])

SELECT "administrators".* FROM "administrators" WHERE "administrators"."id" = ? LIMIT 1  [["id", "1"]]
---
  def update
    @administrator = Administrator.find(params[:id])