trunk/app/controllers/posts_controller.rb

INSERT INTO "posts" ("administrator_id", "content", "created_at", "headline", "updated_at") VALUES (?, ?, ?, ?, ?)  [["administrator_id", 1], ["content", "The first news post :)"], ["created_at", Tue, 24 Jul 2012 15:11:40 UTC +00:00], ["headline", "First!"], ["updated_at", Tue, 24 Jul 2012 15:11:40 UTC +00:00]]
---
	def create
		@post = current_administrator.posts.build(params[:post])

		respond_to do |format|
			if @post.save

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? ORDER BY posts.created_at DESC LIMIT 1  [["id", "2"]]
---
	def edit
    	@post = Post.find(params[:id])

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? ORDER BY posts.created_at DESC LIMIT 1  [["id", "2"]]
UPDATE "posts" SET "content" = 'First post on the website!', "updated_at" = '2012-07-24 15:49:33.354290' WHERE "posts"."id" = 2
---
	def update
		@post = Post.find(params[:id])

    	if @post.update_attributes(params[:post])

DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 1]]
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? ORDER BY posts.created_at DESC LIMIT 1  [["id", "1"]]
---
	def destroy
		Post.find(params[:id]).destroy