trunk/app/controllers/projects_controller.rb

  def index
    @projects = Project.all
---
SELECT "projects".* FROM "projects"

  def show
    @project = Project.find(params[:id])
---
SELECT "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", "1"]]

  def edit
    @project = Project.find(params[:id])
---
SELECT "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @project = Project.new(params[:project])

    respond_to do |format|
      if @project.save
---
INSERT INTO "projects" ("created_at", "email", "lastPaymentDate", "openRegistration", "registrationCost", "spots", "totalCost", "updated_at", "year") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    @project = Project.find(params[:id])
---
SELECT "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", "1"]]