trunk/app/controllers/registrations_controller.rb

SELECT "registrations".* FROM "registrations"
---
    def index
        @registrations = @project.registrations.find(:all, :conditions => { :reserve => false })
        @registrations = @project.registrations.paginate(page: params[:page], :conditions => { :reserve => false }, :order => :firstname, :per_page => 20)

SELECT "registrations".* FROM "registrations" WHERE "registrations"."id" = ? LIMIT 1  [["id", "1"]]
---
    def show
        @registration = @project.registrations.find(params[:id])

SELECT "registrations".* FROM "registrations" WHERE "registrations"."id" = ? LIMIT 1  [["id", "1"]]
---
    def edit
        @registration = Registration.find(params[:id])

INSERT INTO "registrations" ("address", "allergies", "comment", "created_at", "email", "firstname", "grade", "hasPayedRegistration", "hasPayedTotal", "kth_id", "mobilephone", "partey", "postArea", "postalCode", "project_id", "reserve", "surname", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
    def create
        @registration = @project.registrations.build(params[:registration])
        @registration.kth_id = session[:remember_token]

        if @project.registrations.count == @project.spots
            @registration.reserve = true
        end

        if current_attendee != nil && current_administrator != nil
            @registration.kth_id = 'outsider'
        end

        respond_to do |format|
            if @registration.save