trunk/app/controllers/sessions_controller.rb

	def create
		auth_hash = request.env['omniauth.auth']
		kth_id = auth_hash['uid']

		administrator = Administrator.find_by_kth_id(kth_id)
---
SELECT "administrators".* FROM "administrators" WHERE "administrators"."kth_id" = 'u1tcl0jv' LIMIT 1