trunk/app/controllers/sessions_controller.rb

	def new
		administrator = Administrator.find_by_kth_id(session[:cas_user])
---
SELECT "administrators".* FROM "administrators" WHERE "administrators"."kth_id" IS NULL LIMIT 1