trunk/app/controllers/settings_controller.rb

SELECT "settings".* FROM "settings" LIMIT 30 OFFSET 0
---
	def index
		@settings = Setting.paginate(page: params[:page])

SELECT "settings".* FROM "settings" WHERE "settings"."id" = ? LIMIT 1  [["id", "1"]]
---
	def show
		@setting = Setting.find(params[:id])

INSERT INTO "settings" ("created_at", "name", "updated_at", "value") VALUES (?, ?, ?, ?)  [["created_at", Tue, 24 Jul 2012 23:17:31 UTC +00:00], ["name", "first_setting"], ["updated_at", Tue, 24 Jul 2012 23:17:31 UTC +00:00], ["value", "thesettingvalue"]]
---
	def create
		@setting = Setting.new(params[:setting])

  		if @setting.save

SELECT "settings".* FROM "settings" WHERE "settings"."id" = ? LIMIT 1  [["id", "2"]]
---
	def edit
		@setting = Setting.find(params[:id])

SELECT "settings".* FROM "settings" WHERE "settings"."id" = ? LIMIT 1  [["id", "2"]]
---
	def update
		@setting = Setting.find(params[:id])

DELETE FROM "settings" WHERE "settings"."id" = ?  [["id", 1]]
SELECT "settings".* FROM "settings" WHERE "settings"."id" = ? LIMIT 1  [["id", "1"]]
---
	def destroy
		Setting.find(params[:id]).destroy