trunk/app/controllers/static_pages_controller.rb

SELECT "posts".* FROM "posts" ORDER BY posts.created_at DESC LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "posts"
---
  def home
  	@project = Project.limit(1).find_by_openRegistration(true)

  	@post = Post.new
  	@posts = Post.paginate(page: params[:page])