trunk/app/views/projects/show.html.erb

<p>
  <% if @project.registrations.any? %>
---
SELECT COUNT(*) FROM "registrations" WHERE "registrations"."project_id" = 1